// Створити і описати сутності Багатоквартирного будинку, квартири, мешканців
// Додати можливість створювати нові будинки на певну кількість квартир з певною кількістю мешканців
// Кількість квартир в будинку та мешканців в кожній квартирі задає користувач
// Реалізувати перевірку на пусті значення
// Квартири - це Map всередині будинку, а Мешканці - це Set в квартирі
// Реалізувати функціонал виводу даних по будинку після створення
// Функціонал, що пов'язаний з розробкою UI є опціональним, проте загальна логіка взаємодії класів - обов'язкова до виконання,
